In [43]:
import pandas as pd

In [32]:
# source: https://datahub.io/core/airport-codes
iata = pd.read_csv('iatas.csv')

In [22]:
# inspect available columns
iata.head()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,Bensalem,00A,NaN,00A,"-74.93360137939453, 40.07080078125"
1,00AA,small_airport,Aero B Ranch Airport,3435.0,NaN,US,US-KS,Leoti,00AA,NaN,00AA,"-101.473911, 38.704022"
2,00AK,small_airport,Lowell Field,450.0,NaN,US,US-AK,Anchor Point,00AK,NaN,00AK,"-151.695999146, 59.94919968"
3,00AL,small_airport,Epps Airpark,820.0,NaN,US,US-AL,Harvest,00AL,NaN,00AL,"-86.77030181884766, 34.86479949951172"
4,00AR,closed,Newport Hospital & Clinic Heliport,237.0,NaN,US,US-AR,Newport,NaN,NaN,NaN,"-91.254898, 35.6087"

In [33]:
# keep only necessary columns
iata = iata[['iata_code', 'coordinates']]

In [35]:
# drop rows with no IATA codes
iata = iata.dropna()

In [36]:
# parse coordinates into their own columns
iata['lat'] = iata['coordinates'].apply(lambda x: round(float(x.split(',')[1]),2))
iata['lon'] = iata['coordinates'].apply(lambda x: round(float(x.split(',')[0]),2))

In [37]:
# drop original coordinates column
iata.drop(columns='coordinates', inplace=True)

In [38]:
# confirm output
iata.head()

     iata_code    lat     lon
223        UTK  11.22  169.85
441        OCA  25.33  -80.27
598        PQS  61.93 -162.90
677        CSE  38.85 -106.93
1094       JCY  30.25  -98.62

In [45]:
# check for duplicates
len(iata)

9229

In [79]:
iata['iata_code'].nunique()

9109

In [49]:
# remove strange values where len() < 3
iata = iata[iata['iata_code'].str.len() == 3]

           lat  lon
iata_code
-            1    1
0           77   77
AAA          1    1
AAB          1    1
AAC          1    1
...        ...  ...
ZYI          1    1
ZYL          1    1
ZZO          1    1
ZZU          1    1
ZZV          1    1

[9111 rows x 2 columns]

In [78]:
len(iata)

9109

In [80]:
iata.head()

  iata_code    lat     lon
0       AAA -17.35 -145.51
1       AAB -26.69  141.05
2       AAC  31.07   33.84
3       AAD   6.10   46.64
4       AAE  36.82    7.81

In [81]:
# spot check a few codes versus google maps to ensure accuracy
iata[iata['iata_code'] == 'SEA']

     iata_code    lat     lon
6785       SEA  47.45 -122.31

In [82]:
# save cleaned df to file
iata.to_csv('iata_clean.csv', index=False)